## Staging: prereqs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                          |
|--------|--------------------------------------------------------|
| add    | `aws_iam_role.production_dns_manager[0]`               |
|        | `aws_iam_role.scratch_dns_manager[0]`                  |
|        | `aws_iam_role.staging_dns_manager[0]`                  |
|        | `aws_iam_role_policy.production_dns_manager_policy[0]` |
|        | `aws_iam_role_policy.scratch_dns_manager_policy[0]`    |
|        | `aws_iam_role_policy.staging_dns_manager_policy[0]`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.production_dns_manager[0] will be created
  + resource "aws_iam_role" "production_dns_manager" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "296255494825"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "production_dns_manager_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.scratch_dns_manager[0] will be created
  + resource "aws_iam_role" "scratch_dns_manager" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "419291849580"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "scratch_dns_manager_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.staging_dns_manager[0] will be created
  + resource "aws_iam_role" "staging_dns_manager" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "239043911459"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging_dns_manager_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.production_dns_manager_policy[0] will be created
  + resource "aws_iam_role_policy" "production_dns_manager_policy" {
      + id     = (known after apply)
      + name   = "production_dns_manager_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "route53:GetHostedZone",
                          + "route53:ListResourceRecordSets",
                          + "route53:ListHostedZones",
                          + "route53:ChangeResourceRecordSets",
                          + "route53:ListResourceRecordSets",
                          + "route53:GetHostedZoneCount",
                          + "route53:ListHostedZonesByName",
                          + "route53:GetChange",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy.scratch_dns_manager_policy[0] will be created
  + resource "aws_iam_role_policy" "scratch_dns_manager_policy" {
      + id     = (known after apply)
      + name   = "scratch_dns_manager_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "route53:GetHostedZone",
                          + "route53:ListResourceRecordSets",
                          + "route53:ListHostedZones",
                          + "route53:ChangeResourceRecordSets",
                          + "route53:ListResourceRecordSets",
                          + "route53:GetHostedZoneCount",
                          + "route53:ListHostedZonesByName",
                          + "route53:GetChange",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy.staging_dns_manager_policy[0] will be created
  + resource "aws_iam_role_policy" "staging_dns_manager_policy" {
      + id     = (known after apply)
      + name   = "staging_dns_manager_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "route53:GetHostedZone",
                          + "route53:ListResourceRecordSets",
                          + "route53:ListHostedZones",
                          + "route53:ChangeResourceRecordSets",
                          + "route53:ListResourceRecordSets",
                          + "route53:GetHostedZoneCount",
                          + "route53:ListHostedZonesByName",
                          + "route53:GetChange",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.production_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.scratch_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.staging_dns_manager[0]"]

20 tests, 17 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
